---
title: StructuralSectionAnalysisParams
classe: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams
namespace: Autodesk.Revit.DB.Structure.StructuralSections
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 17
---

# StructuralSectionAnalysisParams

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double ElasticModulusStrongAxis { get; set; }` | `structuralSectionAnalysisParams.ElasticModulusStrongAxis` | Double |
| `Double ElasticModulusWeakAxis { get; set; }` | `structuralSectionAnalysisParams.ElasticModulusWeakAxis` | Double |
| `Boolean IsValidObject { get; }` | `structuralSectionAnalysisParams.IsValidObject` | Boolean |
| `Double MomentOfInertiaStrongAxis { get; set; }` | `structuralSectionAnalysisParams.MomentOfInertiaStrongAxis` | Double |
| `Double MomentOfInertiaWeakAxis { get; set; }` | `structuralSectionAnalysisParams.MomentOfInertiaWeakAxis` | Double |
| `Double NominalWeight { get; set; }` | `structuralSectionAnalysisParams.NominalWeight` | Double |
| `Double Perimeter { get; set; }` | `structuralSectionAnalysisParams.Perimeter` | Double |
| `Double PlasticModulusStrongAxis { get; set; }` | `structuralSectionAnalysisParams.PlasticModulusStrongAxis` | Double |
| `Double PlasticModulusWeakAxis { get; set; }` | `structuralSectionAnalysisParams.PlasticModulusWeakAxis` | Double |
| `Double PrincipalAxesAngle { get; set; }` | `structuralSectionAnalysisParams.PrincipalAxesAngle` | Double |
| `Double SectionArea { get; set; }` | `structuralSectionAnalysisParams.SectionArea` | Double |
| `Double ShearAreaStrongAxis { get; set; }` | `structuralSectionAnalysisParams.ShearAreaStrongAxis` | Double |
| `Double ShearAreaWeakAxis { get; set; }` | `structuralSectionAnalysisParams.ShearAreaWeakAxis` | Double |
| `Double TorsionalModulus { get; set; }` | `structuralSectionAnalysisParams.TorsionalModulus` | Double |
| `Double TorsionalMomentOfInertia { get; set; }` | `structuralSectionAnalysisParams.TorsionalMomentOfInertia` | Double |
| `Double WarpingConstant { get; set; }` | `structuralSectionAnalysisParams.WarpingConstant` | Double |
| `Void Dispose()` | `structuralSectionAnalysisParams.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```